{
  "backend/main.mo": "Motoko actor implementing user profiles, meetings, messages, documents, and notices with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping meeting history, recent meetings, and member search features to their implementation files.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file including pages, components, hooks, and configuration.",
  "frontend/index.css": "Empty placeholder stylesheet file.",
  "frontend/index.html": "Base HTML file mounting the React application and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app managing navigation, authentication state, and conditional rendering of all views.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for new users to submit and validate basic profile info before accessing the app.",
  "frontend/src/components/SiteHeader.tsx": "Header bar with navigation, authentication controls, and admin‑aware menus.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor using the current Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend methods such as profiles, members, meetings, messages, and documents.",
  "frontend/src/index.css": "Configures Tailwind CSS and defines custom color variables and utility classes for the app’s theme.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/DashboardPage.tsx": "Displays the user's dashboard with profile info, principal ID, and navigation actions after fetching the user profile.",
  "frontend/src/pages/DocumentVaultPage.tsx": "Implements the document vault UI, allowing users to upload, download, and delete documents with progress tracking.",
  "frontend/src/pages/HomePage.tsx": "Provides a landing page with hero content, feature highlights, and navigation buttons for sign-in and sign-up.",
  "frontend/src/pages/MeetingHistoryPage.tsx": "Displays a searchable list of past meetings with loading, error, and empty states.",
  "frontend/src/pages/MeetingsPage.tsx": "Shows meetings and allows admins to create new ones, including form handling and access control.",
  "frontend/src/pages/MemberAreaPage.tsx": "Displays and allows editing of the logged-in user’s profile with validation and save logic.",
  "frontend/src/pages/MemberSearchPage.tsx": "Provides searchable member listings with loading, error, and no-results handling.",
  "frontend/src/pages/MembersPage.tsx": "Admin-only page showing member count and a table of all members with loading and error states.",
  "frontend/src/pages/MessagesPage.tsx": "Displays inbox messages and provides a form to send messages with username validation and error handling.",
  "frontend/src/pages/NoticeBoardPage.tsx": "Shows all notices, allows admins to create and delete notices, and handles validation and loading states.",
  "frontend/src/pages/RecentMeetingsPage.tsx": "Lists the 10 most recent meetings with search filtering and support for loading, error, and empty states.",
  "frontend/src/pages/SignInPage.tsx": "Provides Internet Identity login with loading and error feedback and a link to the signup page.",
  "frontend/src/pages/SignUpPage.tsx": "Handles user registration with Internet Identity authentication, form validation, and success redirect.",
  "frontend/src/utils/textSearch.ts": "Provides helper functions for normalizing text, checking case-insensitive matches, and filtering item arrays by search queries.",
  "frontend/src/utils/urlParams.ts": "Handles reading, storing, and clearing URL and session-stored parameters, including support for hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color variables, layout settings, and plugin setup.",
  "project_state.json": "JSON file describing project state, existing features, pending requests, and metadata for meeting-related UI sections."
}